---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.StyleType
source: html/2c31c41a-cd12-4fef-2b2e-439012efc810.htm
---
# Autodesk.Revit.DB.DimensionType.StyleType Property

The dimension style type of this DimensionType.

## Syntax (C#)
```csharp
public DimensionStyleType StyleType { get; }
```